Revit 2027 API
BuiltInFailures.ExportFailures.IFCGenericExportWarning Property
 Unexpected errors occurred while exporting these elements to the IFC file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IFCGenericExportWarning { get; }
Public Shared ReadOnly Property IFCGenericExportWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IFCGenericExportWarning {
	FailureDefinitionId^ get ();
}
static member IFCGenericExportWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExportFailures Class
Autodesk.Revit.DB Namespace